DataProcessors/ЛБ_ПомощникВводаМестаРождения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЛБ_ПомощникВводаМестаРождения</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МестоРожденияСтрана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРожденияОбласть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРожденияРайон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРожденияНаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРожденияСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ЛБ_ПомощникВводаМестаРождения/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Создать(Команда)
	// ++ Сербаев 31.05.2023
	//Если НЕ ОсобоеМестоРождения Тогда
	//	Если НЕ ПроверитьЗаполнение() Тогда
	//		Возврат;   	
	//	КонецЕсли;	
	//	Если НЕ ПроверитьМесторождениеЗалогодателя(Объект.МестоРожденияСтрана, Объект.МестоРожденияОбласть, Объект.МестоРожденияРайон, Объект.МестоРожденияНаселенныйПункт) Тогда
	//		Возврат;   	
	//	КонецЕсли;	
	//КонецЕсли;	
	//СтруктураРезультат = Новый Структура;
	//СтруктураРезультат.Вставить("МестоРожденияСтрана", Объект.МестоРожденияСтрана);
	//СтруктураРезультат.Вставить("МестоРожденияОбласть", Объект.МестоРожденияОбласть);
	//СтруктураРезультат.Вставить("МестоРожденияРайон", Объект.МестоРожденияРайон);
	//СтруктураРезультат.Вставить("МестоРожденияНаселенныйПункт", Объект.МестоРожденияНаселенныйПункт);
	//СтруктураРезультат.Вставить("МестоРождения", Объект.МестоРожденияСтрока);
	//ЭтаФорма.Закрыть(СтруктураРезультат); 
	Модифицированность = Ложь;
	ЗакрытьФормуВводаАдреса();
	// -- Сербаев 31.05.2023
КонецПроцедуры

&НаСервере
Функция ПроверитьМесторождениеЗалогодателя(Страна, Область, Район, НаселенныйПункт)
  	СтруктураВозврата = ЛБ_ОбщийМодуль.ПроверитьМесторождениеЗалогодателя(Страна, Область, Район, НаселенныйПункт);
	Если НЕ СтруктураВозврата.Результат Тогда
		Сообщить(СтруктураВозврата.Сообщение, СтатусСообщения.Важное);
	КонецЕсли;
	Возврат СтруктураВозврата.Результат;
КонецФункции

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть(неопределено);
КонецПроцедуры

&НаКлиенте
Процедура МестоРожденияОбластьПриИзменении(Элемент)
	
	// ++ Сербаев 16.06.2023
	Если Не ПустаяСтрока(СокрЛП(Объект.МестоРожденияОбласть)) Тогда
		ТекстОшибки = ЛБ_ОбщегоНазначения.СообщитьЕслиСтрокаНеправильная(Объект.МестоРожденияОбласть, "Область");
		Если ТекстОшибки <> "" Тогда 	
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , , "Объект.МестоРожденияОбласть");
			Возврат;
		КонецЕсли;
	КонецЕсли;
    // -- Сербаев 16.06.2023
	
	Объект.МестоРожденияОбласть = ЛБ_ОбщегоНазначения.ПрописнаяПерваяБуква(Объект.МестоРожденияОбласть);
	ЗаполнитьМестоРожденияСтрока();
КонецПроцедуры

&НаКлиенте
Процедура МестоРожденияРайонПриИзменении(Элемент) 
	
	// ++ Сербаев 16.06.2023
	Если Не ПустаяСтрока(СокрЛП(Объект.МестоРожденияРайон)) Тогда
		ТекстОшибки = ЛБ_ОбщегоНазначения.СообщитьЕслиСтрокаНеправильная(Объект.МестоРожденияРайон, "Район");
		Если ТекстОшибки <> "" Тогда 	
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , , "Объект.МестоРожденияРайон");
			Возврат;
		КонецЕсли;
	КонецЕсли;
    // -- Сербаев 16.06.2023
	
	Объект.МестоРожденияРайон = ЛБ_ОбщегоНазначения.ПрописнаяПерваяБуква(Объект.МестоРожденияРайон);
	ЗаполнитьМестоРожденияСтрока();
КонецПроцедуры

&НаКлиенте
Процедура МестоРожденияНаселенныйПунктПриИзменении(Элемент)
	
	// ++ Сербаев 15.06.2023
	Если Не ПустаяСтрока(СокрЛП(Объект.МестоРожденияНаселенныйПункт)) Тогда
		ТекстОшибки = ЛБ_ОбщегоНазначения.СообщитьЕслиСтрокаНеправильная(Объект.МестоРожденияНаселенныйПункт, "Город(Населенный пункт)");
		Если ТекстОшибки <> "" Тогда 	
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , , "Объект.МестоРожденияНаселенныйПункт");
			Возврат;
		КонецЕсли;
	КонецЕсли;
    // -- Сербаев 15.06.2023
	
	Объект.МестоРожденияНаселенныйПункт = ЛБ_ОбщегоНазначения.ПрописнаяПерваяБуква(Объект.МестоРожденияНаселенныйПункт);
	ЗаполнитьМестоРожденияСтрока();
КонецПроцедуры

&НаКлиенте
Процедура МестоРожденияСтранаПриИзменении(Элемент)
	// ++ Сербаев 16.06.2023 
	Если Не ПустаяСтрока(СокрЛП(Объект.МестоРожденияСтрана)) Тогда
		ТекстОшибки = ЛБ_ОбщегоНазначения.СообщитьЕслиСтрокаНеправильная(Объект.МестоРожденияСтрана, "Страна");
		Если ТекстОшибки <> "" Тогда 	
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , , "Объект.МестоРожденияСтрана");
			Возврат;
		КонецЕсли;
	КонецЕсли;
    // -- Сербаев 16.06.2023
	Объект.МестоРожденияСтрана = ЛБ_ОбщегоНазначения.ПрописнаяПерваяБуква(Объект.МестоРожденияСтрана);
	ЗаполнитьМестоРожденияСтрока();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("МестоРожденияСтрана") тогда
		Объект.МестоРожденияСтрана = Параметры.МестоРожденияСтрана;
	КонецЕсли;	
	Если Параметры.Свойство("МестоРожденияОбласть") тогда
		Объект.МестоРожденияОбласть = Параметры.МестоРожденияОбласть;
	КонецЕсли;
	Если Параметры.Свойство("МестоРожденияРайон") тогда
		Объект.МестоРожденияРайон = Параметры.МестоРожденияРайон;
	КонецЕсли;
	Если Параметры.Свойство("МестоРожденияНаселенныйПункт") тогда
		Объект.МестоРожденияНаселенныйПункт = Параметры.МестоРожденияНаселенныйПункт;
	КонецЕсли;
	Если Параметры.Свойство("МестоРождения") тогда
		Объект.МестоРожденияСтрока = Параметры.МестоРождения;
	КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(Объект.МестоРожденияСтрана) Тогда
	//	Объект.МестоРожденияСтрана = "РОССИЯ";
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМестоРожденияСтрока()
    Объект.МестоРожденияСтрока = ЛБ_ОбщегоНазначения.ЗаполнитьИнфорациюОМестеРождения(Объект.МестоРожденияСтрана, Объект.МестоРожденияОбласть, Объект.МестоРожденияРайон, Объект.МестоРожденияНаселенныйПункт);
    // ++ Сербаев 31.05.2023
	Модифицированность = Истина;
	// -- Сербаев 31.05.2023
КонецПроцедуры


&НаКлиенте
Процедура ОсобоеМестоРожденияПриИзменении(Элемент)
	Если ОсобоеМестоРождения Тогда
	    Объект.МестоРожденияСтрана          = "";
		Объект.МестоРожденияОбласть         = "";
		Объект.МестоРожденияРайон           = "";
		Объект.МестоРожденияНаселенныйПункт = "";
		Объект.МестоРожденияСтрока          = "";
	КонецЕсли;	
	УстановитьДоступность();
КонецПроцедуры

Процедура УстановитьДоступность()
	Если ОсобоеМестоРождения Тогда
		Элементы.МестоРожденияСтрана.Доступность          = Ложь;
		Элементы.МестоРожденияОбласть.Доступность         = Ложь;
		Элементы.МестоРожденияРайон.Доступность           = Ложь;
		Элементы.МестоРожденияНаселенныйПункт.Доступность = Ложь;
		Элементы.МестоРожденияСтрока.ТолькоПросмотр       = Ложь;
	Иначе
		Элементы.МестоРожденияСтрана.Доступность          = Истина;
		Элементы.МестоРожденияОбласть.Доступность         = Истина;
		Элементы.МестоРожденияРайон.Доступность           = Истина;
		Элементы.МестоРожденияНаселенныйПункт.Доступность = Истина;
		Элементы.МестоРожденияСтрока.ТолькоПросмотр       = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ПустаяСтрока(Объект.МестоРожденияСтрока) И 
	 ПустаяСтрока(Объект.МестоРожденияСтрана+Объект.МестоРожденияОбласть+Объект.МестоРожденияРайон+Объект.МестоРожденияНаселенныйПункт) Тогда
		ОсобоеМестоРождения = Истина;
	Иначе
		ОсобоеМестоРождения = ложь;
	КонецЕсли;	
    УстановитьДоступность();
КонецПроцедуры

// ++ Сербаев 31.05.2023
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемФормы", ЭтотОбъект);
		ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ЗакрытьФормуВводаАдреса()
	Если НЕ ОсобоеМестоРождения Тогда
		Если НЕ ПроверитьЗаполнение() Тогда
			Возврат;   	
		КонецЕсли;	
		Если НЕ ПроверитьМесторождениеЗалогодателя(Объект.МестоРожденияСтрана, Объект.МестоРожденияОбласть, Объект.МестоРожденияРайон, Объект.МестоРожденияНаселенныйПункт) Тогда
			Возврат;   	
		КонецЕсли;	
	КонецЕсли;	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("МестоРожденияСтрана", Объект.МестоРожденияСтрана);
	СтруктураРезультат.Вставить("МестоРожденияОбласть", Объект.МестоРожденияОбласть);
	СтруктураРезультат.Вставить("МестоРожденияРайон", Объект.МестоРожденияРайон);
	СтруктураРезультат.Вставить("МестоРожденияНаселенныйПункт", Объект.МестоРожденияНаселенныйПункт);
	СтруктураРезультат.Вставить("МестоРождения", Объект.МестоРожденияСтрока);
	ЭтаФорма.Закрыть(СтруктураРезультат);
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗакрытиемФормы(Результат, ДополнительныеПараметры) Экспорт
	
	Если Модифицированность Тогда
		Модифицированность = Ложь;
		ЗакрытьФормуВводаАдреса();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура МестоРожденияСтрокаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
// -- Сербаев 31.05.2023
